results/raws/summary_echo_large_process_basic.txt
+------------+
| Parameters |
+---------------------------------------------------------------------+
| Target NAME    : echo                                               |
| Target URL     : http://127.0.0.1:6005/large-process                |
| HTTP Method    : POST                                               |
| Connections    : 100                                                |
| Requests       : 10000                                              |
| Duration       : 30                                                 |
| Results Dir    : results                                            |
| Timestamp      : 2025-06-30_23-54-27                                |
| Profile        : Large Process (Basic)                              |
+---------------------------------------------------------------------+

+-----------------+
| Bombardier      |
+------------------------------------+
| Requests    : 10000                |
+------------------------------------+
Bombarding http://127.0.0.1:6005/large-process with 10000 request(s) using 100 connection(s)
 10000 / 10000  100.00% 99/s 1m40s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       100.37     457.78    4925.41
  Latency         1.00s     2.43ms      1.06s
  Latency Distribution
     50%      1.00s
     75%      1.00s
     90%      1.00s
     95%      1.01s
     99%      1.02s
  HTTP codes:
    1xx - 0, 2xx - 10000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    32.33KB/s


+-----------------+
| Go-Wrk          |
+------------------------------------+
| Duration    : 30                   |
+------------------------------------+
Running 30s test @ http://127.0.0.1:6005/large-process
  100 goroutine(s) running concurrently
3000 requests in 30.077197042s, 527.34KB read
Requests/sec:		99.74
Transfer/sec:		17.53KB
Overall Requests/sec:	99.45
Overall Transfer/sec:	17.48KB
Fastest Request:	1s
Avg Req Time:		1.002573s
Slowest Request:	1.016351s
Number of Errors:	0
10%:			1.000063s
50%:			1.000095s
75%:			1.000127s
99%:			1.000127s
99.9%:			1.000127s
99.9999%:		1.000127s
99.99999%:		1.000127s
stddev:			1.982ms


+-----------------+
| Vegeta          |
+------------------------------------+
| Requests    : 10000                |
| Duration    : 30                   |
+------------------------------------+
Requests      [total, rate, throughput]         20149, 670.59, 483.17
Duration      [total, attack, wait]             31.047s, 30.047s, 1s
Latencies     [min, mean, 50, 90, 95, 99, max]  514.7µs, 750.128ms, 1.001s, 1.004s, 1.007s, 1.143s, 1.325s
Bytes In      [total, mean]                     1335089, 66.26
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           74.45%
Status Codes  [code:count]                      0:5148  200:15001  
Error Set:
Post "http://127.0.0.1:6005/large-process": dial tcp 0.0.0.0:0->127.0.0.1:6005: connectex: No connection could be made because the target machine actively refused it.