results/raws/summary_gin_large_process_basic.txt
+------------+
| Parameters |
+---------------------------------------------------------------------+
| Target NAME    : gin                                                |
| Target URL     : http://127.0.0.1:6001/large-process                |
| HTTP Method    : POST                                               |
| Connections    : 100                                                |
| Requests       : 10000                                              |
| Duration       : 30                                                 |
| Results Dir    : results                                            |
| Timestamp      : 2025-06-30_21-16-33                                |
| Profile        : Large Process (Basic)                              |
+---------------------------------------------------------------------+

+-----------------+
| Bombardier      |
+------------------------------------+
| Requests    : 10000                |
+------------------------------------+
Bombarding http://127.0.0.1:6001/large-process with 10000 request(s) using 100 connection(s)
 10000 / 10000  100.00% 99/s 1m40s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       101.81     572.66    7351.93
  Latency         1.00s     1.26ms      1.02s
  Latency Distribution
     50%      1.00s
     75%      1.00s
     90%      1.00s
     95%      1.00s
     99%      1.01s
  HTTP codes:
    1xx - 0, 2xx - 10000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    33.73KB/s


+-----------------+
| Go-Wrk          |
+------------------------------------+
| Duration    : 30                   |
+------------------------------------+
Running 30s test @ http://127.0.0.1:6001/large-process
  100 goroutine(s) running concurrently
3000 requests in 30.051725663s, 568.36KB read
Requests/sec:		99.83
Transfer/sec:		18.91KB
Overall Requests/sec:	99.50
Overall Transfer/sec:	18.85KB
Fastest Request:	1s
Avg Req Time:		1.001724s
Slowest Request:	1.020063s
Number of Errors:	0
10%:			1.000031s
50%:			1.000031s
75%:			1.000031s
99%:			1.000031s
99.9%:			1.000031s
99.9999%:		1.000031s
99.99999%:		1.000031s
stddev:			1.99ms


+-----------------+
| Vegeta          |
+------------------------------------+
| Requests    : 10000                |
| Duration    : 30                   |
+------------------------------------+
Requests      [total, rate, throughput]         19796, 658.72, 482.97
Duration      [total, attack, wait]             31.06s, 30.052s, 1.008s
Latencies     [min, mean, 50, 90, 95, 99, max]  510.8µs, 762.696ms, 1.001s, 1.003s, 1.006s, 1.127s, 1.305s
Bytes In      [total, mean]                     1320088, 66.68
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           75.78%
Status Codes  [code:count]                      0:4795  200:15001  
Error Set:
Post "http://127.0.0.1:6001/large-process": dial tcp 0.0.0.0:0->127.0.0.1:6001: connectex: No connection could be made because the target machine actively refused it.